app/controllers/duenios_controller.rb

SELECT "duenios".* FROM "duenios"
---
  def index
    @duenios = Duenio.all